
combinations_list = [
 [1, 1, 0, 0, 0],
 [1, 0, 1, 0, 0],
 [1, 0, 0, 1, 0],
 [1, 0, 0, 0, 1],
 [0, 1, 1, 0, 0],
 [0, 1, 0, 1, 0],
 [0, 1, 0, 0, 1],
 [0, 0, 1, 1, 0],
 [0, 0, 1, 0, 1],
 [0, 0, 0, 1, 1],
 [1, 1, 1, 0, 0],
 [1, 1, 0, 1, 0],
 [1, 1, 0, 0, 1],
 [1, 0, 1, 1, 0],
 [1, 0, 1, 0, 1],
 [1, 0, 0, 1, 1],
 [0, 1, 1, 1, 0],
 [0, 1, 1, 0, 1],
 [0, 1, 0, 1, 1],
 [0, 0, 1, 1, 1],
 [1, 1, 1, 1, 0],
 [1, 1, 1, 0, 1],
 [1, 1, 0, 1, 1],
 [1, 0, 1, 1, 1],
 [0, 1, 1, 1, 1],
 [1, 1, 1, 1, 1]
]


# combinations_list = [
#  [1, 1, 1, 0, 0],
#  [1, 1, 0, 1, 0],
#  [1, 1, 0, 0, 1],
#  [1, 0, 1, 1, 0],
#  [1, 0, 1, 0, 1],
#  [1, 0, 0, 1, 1],
#  [0, 1, 1, 1, 0],
#  [0, 1, 1, 0, 1],
#  [0, 1, 0, 1, 1],
#  [0, 0, 1, 1, 1],
#  [1, 1, 1, 1, 0],
#  [1, 1, 1, 0, 1],
#  [1, 1, 0, 1, 1],
#  [1, 0, 1, 1, 1],
#  [0, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1]
# ]

def get_combination_by_index(index):
    # if index < 0 or index >= len(combinations_list):
    #     return None
    return combinations_list[index]

# # 示例使用
# example_index = 10 # 可以更改此值以测试其他索引
# example_combination = get_combination_by_index(example_index)
# print(len(combinations_list),example_combination)

